TAL_INT_GIT/Sample Data/BY_WMS/Inventory_Attribute_Adjustment/Input/INV-ATTR-ADJ_request/INV-ATTR-ADJ_request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZWM_NVENTORY_ATTR_ADJUST>
         <!--Optional:-->
         <INPUT>
            <!--Zero or more repetitions:-->
            <item>
               <WH_ID></WH_ID>
               <PRT_CLIENT_ID></PRT_CLIENT_ID>
               <FROM_PRTNUM></FROM_PRTNUM>
               <TO_PRTNUM></TO_PRTNUM>
               <FROM_SUP_LOTNUM></FROM_SUP_LOTNUM>
               <TO_SUP_LOTNUM></TO_SUP_LOTNUM>
               <FROM_EXPIRE_DTE></FROM_EXPIRE_DTE>
               <TO_EXPIRE_DTE></TO_EXPIRE_DTE>
               <FROM_MANDTE></FROM_MANDTE>
               <TO_MANDTE></TO_MANDTE>
               <ADJQTY></ADJQTY>
               <STKUOM></STKUOM>
            </item>
         </INPUT>
         <!--Optional:-->
         <RETURN>
            <!--Zero or more repetitions:-->
            <item>
               <TYPE></TYPE>
               <ID></ID>
               <NUMBER></NUMBER>
               <MESSAGE></MESSAGE>
               <LOG_NO></LOG_NO>
               <LOG_MSG_NO></LOG_MSG_NO>
               <MESSAGE_V1></MESSAGE_V1>
               <MESSAGE_V2></MESSAGE_V2>
               <MESSAGE_V3></MESSAGE_V3>
               <MESSAGE_V4></MESSAGE_V4>
               <PARAMETER></PARAMETER>
               <ROW></ROW>
               <FIELD></FIELD>
               <SYSTEM></SYSTEM>
            </item>
         </RETURN>
      </urn:ZWM_NVENTORY_ATTR_ADJUST>
   </soapenv:Body>
</soapenv:Envelope>